branches/role/Hospitace/app/controllers/observations_controller.rb

  def index
    @observations = Observation.all
---
SELECT "observations".* FROM "observations"