branches/role/Hospitace/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (login LIKE '%turek%') ORDER BY login asc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (login LIKE '%%')
---
  def index

    @users =  User.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 5, :page => params[:page])

INSERT INTO "users" ("created_at", "login", "role", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 21 Oct 2011 21:04:39 UTC +00:00], ["login", "asd"], ["role", "admin"], ["updated_at", Fri, 21 Oct 2011 21:04:39 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save