trunk/Hospitace/app/views/observations/index.html.erb

SELECT `observations`.* FROM `observations`
---
action = { :action_title=>:new_observation, :action=>new_observation_path } if can? :create, Observation %>
<% options = {:small=>(t(:observations,:scope=>"title.small")+" "+select( "selected_semester", "code", Semester.used_current_and_next.collect {|p| [p.name, p.code]}, :selected=>semester.code))} %>