Hospitace/app/views/observations/_form.html.erb

    <%= f.label :user %><br />
    <%= f.select :user, User.all.collect {|p| [ p.full_name, p.id ] } %>
---
SELECT "users".* FROM "users"