Hospitace/app/controllers/home_controller.rb

  def index
    @semesters = Semester.current_and_next

    puts @semesters.inspect
    @observations = []

    @semesters.each do |s|
      @observations << {
        :semester=>s,
        :observations=> Observation.includes(:created_by,:users,:course).where(:semester_id=>s.id,:observation_type=>[:reported,:floating])
---
SELECT `observations`.* FROM `observations` WHERE `observations`.`semester` = 'B112' AND `observations`.`observation_type` IN ('reported', 'floating')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1