Hospitace/app/controllers/notes_controller.rb

SELECT `observations`.* FROM `observations` WHERE `observations`.`id` = 1 LIMIT 1
SELECT `notes`.* FROM `notes` WHERE `notes`.`observation_id` = 1
---
  def index
    @observation = Observation.find(params[:observation_id])
    @notes =  Note.find_all_by_observation_id(params[:observation_id])