Hospitace/app/controllers/observations_controller.rb

  def date
    @observation = Observation.includes(:created_by,:users).find(params[:id])
---
SELECT `observations`.* FROM `observations` WHERE `observations`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def index
    @observations = Observation.includes(:created_by,:users).find_all_by_semester(semester.code).paginate(:page => params[:page])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1)

  def show
    @observation = Observation.includes(:created_by,:users).find(params[:id])
---
SELECT "observations".* FROM "observations" WHERE "observations"."id" = ? LIMIT 1  [["id", "undefined"]]
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    @observation = Observation.new(params[:observation])
    @observation.created_by = current_user
---
INSERT INTO `observations` (`course`, `created_at`, `created_by`, `date`, `observation_type`, `parallel`, `semester`, `updated_at`) VALUES ('A7B36PJV', '2012-02-26 09:59:25', 1, NULL, 'reported', 272507000, 'B112', '2012-02-26 09:59:25')

  def update
    @observation = Observation.find(params[:id])

    respond_to do |format|
      if @observation.update_attributes(params[:observation])
---
SELECT `observations`.* FROM `observations` WHERE `observations`.`id` = 1 LIMIT 1
UPDATE `observations` SET `parallel` = 272507000, `date` = '2012-02-26', `updated_at` = '2012-02-26 12:56:55' WHERE `observations`.`id` = 1