Hospitace/app/controllers/observation_wizard_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @users = User.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:page => params[:page])