Hospitace/app/controllers/observations_controller.rb

SELECT `observations`.* FROM `observations` WHERE `observations`.`semester` = 'B112' AND ((`observations`.`observation_type` = 'unannounced' AND `observations`.`created_by` = 1) || `observations`.`observation_type` !='unannounced') LIMIT 10 OFFSET 0
---
  def index
    @observations = Observation.includes(:created_by,:peoples,:course).where(:semester_id=>semester.id).where("(`observations`.`observation_type` = 'unannounced' AND `observations`.`created_by` = ?) || `observations`.`observation_type` !='unannounced'",current_user.id).paginate(:page => params[:page])