Hospitace/app/controllers/observers_controller.rb

SELECT `observations`.* FROM `observations` WHERE `observations`.`id` = 1 LIMIT 1
SELECT `observers`.* FROM `observers` WHERE `observers`.`observation_id` = 1
---
  def index
    @observation = Observation.find(params[:observation_id])
    @observers = Observer.find_all_by_observation_id(params[:observation_id])