Hospitace/app/controllers/users_controller.rb

  def show
    @user = User.includes(:observers,:created_observations).find(params[:id])
---
SELECT "observations".* FROM "observations" WHERE "observations"."user_id" = 2