Hospitace/app/views/users/_datagrid.html.erb

SELECT `users`.* FROM `users` ORDER BY id asc LIMIT 10 OFFSET 0
---

	<%= f.input User.human_attribute_name(:roles), :collection =>User::ROLES.collect{|i| [t(i), i]},  :as => :check_boxes, :wrapper=>:label_wrapped, :required => false %>