Hospitace/app/views/users/_form.html.erb

      <br />
      <%= f.select :login, @peoples.collect {|p| [ p.full_name, p.username ] } %>
---
SELECT 1 FROM "users" WHERE "users"."login" = 'zdaratom' LIMIT 1