branches/role/Hospitace/app/views/users/_form.html.erb

SELECT 1 FROM "users" WHERE "users"."login" = 'zdaratom' LIMIT 1
---
      <%= f.label :login %><br />
      <%= f.select :login, peoples.collect {|p| [ p.full_name, p.username ] } %>