trunk/Hospitace/app/controllers/observations_controller.rb

SELECT `observations`.* FROM `observations` ORDER BY id asc LIMIT 15 OFFSET 0
---
  def index
    @observations = Observation.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:page => params[:page])

SELECT `observations`.* FROM `observations` WHERE `observations`.`id` = 2 LIMIT 1
---
  def show
    @observation = Observation.find(params[:id])

INSERT INTO `observations` (`course`, `created_at`, `created_by`, `date`, `parallel`, `semester`, `type`, `updated_at`) VALUES ('', '2012-01-06 17:35:00', 1, '2012-01-06', '', '', NULL, '2012-01-06 17:35:00')
---
  def create
    @observation = Observation.new(params[:observation])
    @observation.created_by = current_user

SELECT `observations`.* FROM `observations` WHERE `observations`.`id` = 3 LIMIT 1
DELETE FROM `observations` WHERE `observations`.`id` = 3
---
  def destroy
    @observation = Observation.find(params[:id])
    @observation.destroy