trunk/Hospitace/app/controllers/users_controller.rb

  def index
    @users =  User.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:page => params[:page])
---
SELECT `users`.* FROM `users` WHERE ( login LIKE '%t%' AND roles_mask & 1 > 0) ORDER BY id asc LIMIT 15 OFFSET 0

  def edit
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1